# Задача 1. Врата
#
# Напишите программу, которая выводит в консоль «врата», состоящие из тире, вертикальных линий и пробелов.
# Поле состоит из 20 строк и 30 столбцов (но не стесняйтесь пробовать и другие размеры).
#

x_lim = 30
y_lim = 20

for y in range(y_lim):
    for x in range(x_lim):
        if y == 0:
            print('-', end='')
        elif x == 0 or x == x_lim - 1:
            print('|', end='')
        else:
            print(' ', end='')
    print()

# Задача 2. Дорога
#
# Мы делаем текстовую игру — гонку, и нам нужно вывести на экран что-то вроде трассы, где будут соревноваться наши машины.
# Напишите программу, которая выводит такую дорогу на экран (поле 20×50).
#
# Что нужно сделать, чтобы обочины рисовались поверх горизонтальной линии?
#

x_lim = 50
y_lim = 20

delta = 3  # число 3 выбрано "на глаз", в зависимости от него дорога будет шире/уже

for y in range(y_lim):
    for x in range(x_lim):
        if y == y_lim // 2:
            print('-', end='')
        elif x == x_lim // 2:
            print('|', end='')
        elif x == x_lim // 2 - (delta + y):
            print('/', end='')
        elif x == x_lim // 2 + (delta + y):
            print('\\', end='')  # \ - символ который используется для экранирования, поэтому его пришлось дублировать
        else:
            print(' ', end='')
    print()

# Вариант с рисованием обочины поверх горизонтальной линии:
for y in range(y_lim):
    for x in range(x_lim):

        if x == x_lim // 2 - (delta + y):
            print('/', end='')
        elif x == x_lim // 2 + (delta + y):
            print('\\', end='')  # \ - символ который используется для экранирования, поэтому его пришлось дублировать
        elif y == y_lim // 2:
            print('-', end='')
        elif x == x_lim // 2:
            print('|', end='')

        else:
            print(' ', end='')
    print()

# Задача 3. Диагональная матрица
#
# Напишите программу, которая получает на вход размер квадратной матрицы и выводит на экран по такому принципу
# диагональ из единиц с левого нижнего угла до верхнего правого, ниже диагонали — двойки, выше — нули.
#
# Пример:

n = int(input("Введите размер матрицы: "))

for y in range(n):
    for x in range(n):
        buf_x = (n - 1) - y  # вспомогательное число, которое будет уменьшаться от n-1 до 0
        if buf_x > x:
            print(0, end='\t')
        elif buf_x == x:
            print(1, end='\t')
        else:
            print(2, end='\t')
    print()
