# Задача 1. Надоедливый заказчик
#
# Нашему заказчику нужно, чтобы фраза «Я — программист!» выводилась на экран столько раз, сколько он сам этого захочет.
#
# Напишите программу, которая запрашивает число — количество строчек с фразой «Я — программист!» —
# и столько же раз выводит на экран эту фразу. Для решения задачи используйте переменную-счётчик,
# которая увеличивается на единицу до тех пор, пока не будет введено нужное количество слов.
#
#
#

phrase_count = 0
need_count = int(input("Сколько раз вывести фразу? "))
while phrase_count < need_count:
    print("Я — программист!")
    phrase_count += 1


# Задача 2. Напоминалка
#
# У Евгения много работы, а ещё он очень забывчивый. Иногда он забывает о какой-нибудь важной встрече,
# и ему приходится выслушивать критику от начальства. Напишите для него программу-напоминалку.
# В самом начале программа спрашивает, сколько раз ему напомнить, а затем нужное количество раз выводит: «Вы хотели не забыть о чём-то».
#
#
#

current_remind_count = 0
target_remind_count = int(input("Сколько раз напомнить? "))
while current_remind_count < target_remind_count:
    print("Вы хотели не забыть о чём-то")
    current_remind_count += 1


# Задача 3. Рыбалка
#
# Наши прекрасные родственники удачно сходили на рыбалку. Настолько, что ходили мешком перетаскивать рыбу с берега в машину целых n раз.
# Каждый мешок они взвешивали на электронных весах (все мешки весили по-разному).
# Напишите программу для весов, которая считает суммарный вес мешков и выводит его на экран.

n = int(input("Сколько раз ходили на рыбалку? "))
fishing_count = 0
fish_weight = 0

while fishing_count < n:
    fish_weight += int(input("Сколько поймали? "))
    fishing_count += 1

print("Суммарный вес:", fish_weight)