# Задача 1. Прятки
# Наверное, все мы в детстве играли в прятки. И конечно же всегда был “голя” - тот, кто всех ищет. И пока все прячутся,
# он с закрытыми глазами ведёт обратный отсчёт секунд.
#
# Напишите программу, которая получает на вход количество секунд N и выводит все числа от N до 1 в порядке убывания.
# В конце выведите сообщение “Я иду искать!”
#
# Пример:
#
# Введите кол-во секунд: 5
# 5
# 4
# 3
# 2
# 1
# Я иду искать!
#
#

n = int(input("Сколько секунд считать? "))
for i in range(n, 0, -1):
    print(i)
print("Я иду искать!")

# Задача 2. Армия
# У офицера сегодня очень плохое настроение: он выстроил всех солдат в шеренгу и, начиная с конца,
# начал спрашивать у каждого четвёртого солдата сколько правил прописано в воинском уставе. Количество правил с каждым разом меняется.
# Если солдат ответил неверно, то применяется закон под названием “упал-отжался”.
# Количество отжиманий считается как 10 умножить на порядковый номер солдата в шеренге. Напишите программу,
# которая посчитает сколько в сумме получится таких отжиманий.
#
# Усложнение: напишите программу так, чтобы офицер начинал спрашивать не с последнего солдата в шеренге, а с четвертого с конца.
# Если солдат в шеренге слишком мало, офицер не спрашивает никого
#
#

soldier_count = int(input("Сколько солдат в шеренге? "))
rules_count = 1
push_ups_count = 0
for soldier in range(soldier_count, 0, -4):
    rules_count = (rules_count + soldier * 3) % soldier_count  # изменять количество правил можно любой формулой, это не единственный
    # вариант
    soldier_var = int(input("Сколько правил? "))
    if soldier_var != rules_count:
        push_ups_count += soldier * 10
        print("упал-отжался", soldier * 10, "раз")

print("Всего отжиманий", push_ups_count)

soldier_count = int(input("Сколько солдат в шеренге? "))
rules_count = 1
push_ups_count = 0
for soldier in range(soldier_count - 3, 0, -4):
    rules_count = (rules_count + soldier * 3) % soldier_count
    soldier_var = int(input("Сколько правил? "))
    if soldier_var != rules_count:
        push_ups_count += soldier * 10
        print("упал-отжался", soldier * 10, "раз")

print("Всего отжиманий", push_ups_count)

# Задача 3. Прятки 2
# Пока все прятались, “голя” решил схитрить и считать секунды быстрее, чем нужно.
#
# Напишите программу, которая выводит только чётные числа в порядке убывания от N до 1 включительно,
# используя цикл for. Нельзя использовать условный оператор.

n = int(input("Сколько секунд считать? "))
even_n = n - n % 2  # n%2 для чётных чисел будет равно 0, для нечетных будет равно 1, таким образом мы из числа n всегда будем получать
# чётное число
for i in range(even_n, 0, -2):
    print(i)
print("Я иду искать!")
