# Задача 1. Урок литературы
# Выполните задание, разобранное в уроке.
#
# К уроку литературы нужно было прочитать “Евгения Онегина”. Учитель задаёт вопрос пяти случайным детям. Она задаёт вопрос
# “Кто написал произведение?” и если ученик не угадывает, то учитель ставит двойку и спрашивает следующего. Если хоть кто-то угадает,
# то вопросы больше не задаются. Напишите программу, которая посчитает количество двоечников из этих пяти.
#
#
#
right_answer = "Пушкин"
loser_count = 0
for _ in range(5):
    student_answer = input("Кто написал произведение?")
    if student_answer == right_answer:
        break
    print("Ставим двойку! Неси дневник!")
    loser_count += 1

print("Двоечников: ", loser_count)

# Задача 2. Начальник
# Напишите программу для робота-начальника. Он спрашивает у пользователя, выполнил ли он задание, которые выдавал вчера,
# и продолжает это делать до тех пор, пока тот не ответит ему “Да, конечно, сделал”.
#
#
#

break_answer = "Да, конечно, сделал"

while True:
    user_input = input("Выполнил задание? ")
    if user_input == break_answer:
        break

# Альтернативный вариант:

break_answer = "Да, конечно, сделал"
user_input = ""
while break_answer != user_input:
    user_input = input("Выполнил задание? ")

# Задача 3. Дразнилка.
# Напишите программу-дразнилку “Купи слона”. Она спрашивает у пользователя, как его зовут, затем отвечает “%username%, купи слона”.
# Дальше, что бы он ни говорил, она передразнивает: Все говорят “...”, а ты купи слона!
#
# Пример:
#
# Как тебя зовут? Дима
#
# Дима, купи слона!
#
# Хорошо, давай куплю
#
# Все говорят Хорошо, давай куплю, а ты купи слона!
#
# ...
user_name = input("Как тебя зовут? ")
print(user_name + ",", "купи слона!")
while True:
    user_answer = input("\n")
    print("Все говорят", user_answer + ",", "а ты купи слона!")
