# Задача 1. Доска
# Используя новые знания с циклами и оператором end, выведете на экран “доску”, которую вы делали в первом модуле
#
#
#
#

print("-" * 10)
for i in range(10):
    if i == 0 or i == 9:
        print("|", end="")
    else:
        print("0", end="")
print()
for i in range(10):
    if i == 0 or i == 9:
        print("|", end="")
    else:
        print("0", end="")
print()
for i in range(10):
    if i == 0 or i == 9:
        print("|", end="")
    else:
        print("0", end="")
print()
for i in range(10):
    if i == 0 or i == 9:
        print("|", end="")
    else:
        print("0", end="")
print()
print("-" * 10)

# Альтернативный вариант с вложенным циклом:
print("-" * 10)
for _ in range(4):
    for i in range(10):
        if i == 0 or i == 9:
            print("|", end="")
        else:
            print("0", end="")
    print()
print("-" * 10)
# Задача 2. Локальная сеть
# У Никиты дома есть много компьютеров, которые он хочет подключить к одной локальной сети.
# Для этого ему нужно сгенерировать айпи адрес для каждого компьютера.
# Айпи адрес записывается как 4 числа, которые отделяются точкой. Не долго думая, для генерации Никита решил использовать
# арифметическую прогрессию, причём первые 3 числа в адресе - это члены прогрессии, а последнее число - это её сумма.
#
# Напишите программу, где пользователь вводит первый член прогрессии и разность и в результате получает айпи-адрес.
#
#
#

first_elem = int(input("Введите первый элемент: "))
delta = int(input("Введите разность: "))
print(first_elem, end='.')
last_sum = first_elem
for _ in range(2):
    first_elem += delta
    last_sum += first_elem
    print(first_elem, end='.')
print(last_sum)

# Задача 3. Табло
# Петя пишет компьютерную спортивную игру, где каждый “гол” это десять очков. Он хочет сделать красивое табло с градацией этих очков.
#
# Пользователь вводит число N (N >= 0). Реализуйте программу, которая выводит в одну строчку каждое десятое число,
# разделяя их символами “-=-”. Эти же символы стоят перед первым числом и после последнего.
#
# Пример:
#
# Введите число: 50
#
# -=- 0 -=- 10 -=- 20 -=- 30 -=- 40 -=- 50 -=-


n = int(input("Введите число: "))

print("-=-", end=" ")
for i in range(0, n + 1, 10):
    print(i, end=" -=- ")
