# Модуль 2. Задача 1. Пропавшая переменная
#
# Найдите в программе необъявленную переменную и объявите её, присвоив ей значение ‘Кот’.
# client = ‘Петя’
# print(client)
# print(‘ и ’)
# print(pet)
#
# Что оценивается
# Результат вывода корректен, нет ошибок. Присвоено значение переменной pet.
# Отсутствуют пробелы после print и перед скобками: “print ()” — неверно, “print()” — верно.
# Нет пробелов и внутри скобок.
# Знак равенства выделен пробелами с двух сторон: “client = ‘Петя’” — верно, “client=‘Петя’” — неверно.

client = 'Петя'
print(client)
print(' и ')
pet = 'Кот'
print(pet)